app/controllers/movies_controller.rb

  def index
    if( (params[:sort] == nil) && (params[:ratings] == nil) &&
        ( (session[:sort] != nil) || (session[:ratings] != nil) ) )
      redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
    end

    @sort_by = params[:sort]
    @ratings = params[:ratings]
    if (@ratings != nil)
      ratings = @ratings.keys
    else
      ratings = Movie.ratings
    end

    @all_ratings = Movie.ratings.inject(Hash.new) do |all_ratings, rating|
        if(@ratings != nil)
          all_ratings[rating] = @ratings.has_key?(rating)
        else
          all_ratings[rating] = false
        end
        all_ratings
      end

    if (@sort_by != nil)
        @movies = Movie.order("#{@sort_by} ASC").find_all_by_rating(ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG') ORDER BY release_date ASC